//1.	Написать функцию SetCursor, которая устанавливает координаты и цвет текста.Функция принимает три аргумента : координата по X, координата по Y, номер цвета.

//2.	Написать функцию Line, которую можно будет вызвать так :
//Line(20, '@', 12, true);
//и при этом горизонтальная нарисуется линия, состоящая из 20 «собачек» красного цвета.
//Если передать в последнем параметре false – линия станет вертикальной.

//3.	Написать функцию Rectangle, которая выводит на экран прямоугольник.
//Функция принимает такие параметры : ширина, высота, символ рамки, символ заливки, цвет рамки,
//цвет заливки, координаты верхнего левого угла по X и Y.
//У функции должны быть параметры по умолчанию.

//4.	Написать функцию, которая возвращает куб переданного числа.

//5.	Написать функцию, которая проверяет, является ли переданное ей число простым.
//Число называется простым, если оно делится без остатка только на себя и на единицу.

//6.	Написать функцию, которая получает в качестве параметров 2 целых числа и возвращает сумму
//чисел из диапазона между ними.

//7.	Написать функцию, которая принимает две даты(т.е.функция принимает шесть параметров)
//и вычисляет разность в днях между этими датами. Для решения этой задачи необходимо также написать
//функцию, которая определяет, является ли год високосным.

//8.	Написать функцию, определяющую среднее арифметическое элементов передаваемого ей массива.

//9.	Написать функцию, показывающую на экран минимум и максимум(значение и индекс) среди элементов передаваемого ей массива.

//10. Написать функцию, меняющую порядок следования элементов передаваемого ей массива на противоположный.

//11.	Функция рисует красивую цветную игральную карту.
//В качестве параметров передаются масть и достоинство карты.

//12.	Функция рисует красивый цветной игральный кубик.
//В качестве параметров передаются случайные цвет, координаты и значение кубика.

//13.	Написать функцию для округления заданного числа до указанного количества знаков после запятой.

//14.	Написать игру «Крестики - нолики», реализовать 3 уровня сложности.
//Режим: человек – компьютер.Для реализации построить многофайловый проект.

//15.	Написать игру «Пятнашки».

//16.	Написать функцию Module для расчёта остатка от деления двух чисел.
//Предусмотреть перегрузки для типов(int, double, float).
//Не использовать стандартные функции!(оператор % можно использовать).
//Набор значений для тестирования :
//Module(5.3, 2); // Результат 1.3
//Module(18.5, 4.2); // Результат 1.7
//Module(-18.5, 4.2); // Результат -1.7
//Module(-18.5, -4.2); // Результат -1.7
//Module(4, 3); // Результат 1
//Module(3.2, 4); // Результат 3.2
//Module(4, 0); // Результат -1.#IND00 (NaN)

//17. Разбить код лабиринта(из предыдущей темы по двумерным массивам) на функции, на своё усмотрение.

